import pandas as pd

class Constants_Calculation:
    #набор городов для ВСЕ 4-45
    regions_dict_4_45 = {
    12: 'ЕКАТЕРИНБУРГ 4-45',
    19: 'КАЗАНЬ 4-45',
    23: 'КРАСНОДАР 4-45',
     4: 'НИЖНИЙ НОВГОРОД 4-45',
    15: 'НОВОСИБИРСК 4-45',
     2: 'САНКТ-ПЕТЕРБУРГ 4-45',
    13: 'ЧЕЛЯБИНСК 4-45',
     5: 'ВОЛГОГРАД 4-45',
     8: 'ВОРОНЕЖ 4-45',
    25: 'ИРКУТСК 4-45',
    14: 'ПЕРМЬ 4-45',
     9: 'РОСТОВ-НА-ДОНУ 4-45',
    10: 'САРАТОВ 4-45',
    16: 'ТЮМЕНЬ 4-45',
    18: 'ВЛАДИВОСТОК 4-45',
    39: 'СТАВРОПОЛЬ 4-45',
    26: 'ХАБАРОВСК 4-45',
     6: 'САМАРА 4-45',
    17: 'КРАСНОЯРСК 4-45'
    }

    regions_dict_6_54 = {
        40: 'БАРНАУЛ 6-54',
        18: 'ВЛАДИВОСТОК 6-54',
        5: 'ВОЛГОГРАД 6-54',
        8: 'ВОРОНЕЖ 6-54',
        25: 'ИРКУТСК 6-54',
        45: 'КЕМЕРОВО 6-54',
        23: 'КРАСНОДАР 6-54',
        17: 'КРАСНОЯРСК 6-54',
        4: 'НИЖНИЙ НОВГОРОД 6-54',
        15: 'НОВОСИБИРСК 6-54',
        21: 'ОМСК 6-54',
        14: 'ПЕРМЬ 6-54',
        9: 'РОСТОВ-НА-ДОНУ 6-54',
        6: 'САМАРА 6-54',
        10: 'САРАТОВ 6-54',
        39: 'СТАВРОПОЛЬ 6-54',
        3: 'ТВЕРЬ 6-54',
        55: 'ТОМСК 6-54',
        16: 'ТЮМЕНЬ 6-54',
        20: 'УФА 6-54',
        26: 'ХАБАРОВСК 6-54',
        13: 'ЧЕЛЯБИНСК 6-54',
        7: 'ЯРОСЛАВЛЬ 6-54'
    }

    regions_dict_14_54 = {
        40: 'БАРНАУЛ 14-54',
        18: 'ВЛАДИВОСТОК 14-54',
        5: 'ВОЛГОГРАД 14-54',
        8: 'ВОРОНЕЖ 14-54',
        25: 'ИРКУТСК 14-54',
        19: 'КАЗАНЬ 14-54',
        45: 'КЕМЕРОВО 14-54',
        23: 'КРАСНОДАР 14-54',
        17: 'КРАСНОЯРСК 14-54',
        21: 'ОМСК 14-54',
        14: 'ПЕРМЬ 14-54',
        9: 'РОСТОВ-НА-ДОНУ 14-54',
        6: 'САМАРА 14-54',
        10: 'САРАТОВ 14-54',
        39: 'СТАВРОПОЛЬ 14-54',
        3: 'ТВЕРЬ 14-54',
        55: 'ТОМСК 14-54',
        16: 'ТЮМЕНЬ 14-54',
        20: 'УФА 14-54',
        26: 'ХАБАРОВСК 14-54',
        13: 'ЧЕЛЯБИНСК 14-54',
        7: 'ЯРОСЛАВЛЬ 14-54'
    }

    regions_dict_18 = {
        40: 'БАРНАУЛ 18+',
        18: 'ВЛАДИВОСТОК 18+',
        5: 'ВОЛГОГРАД 18+',
        8: 'ВОРОНЕЖ 18+',
        12: 'ЕКАТЕРИНБУРГ 18+',
        25: 'ИРКУТСК 18+',
        19: 'КАЗАНЬ 18+',
        45: 'КЕМЕРОВО 18+',
        23: 'КРАСНОДАР 18+',
        17: 'КРАСНОЯРСК 18+',
        4: 'НИЖНИЙ НОВГОРОД 18+',
        15: 'НОВОСИБИРСК 18+',
        21: 'ОМСК 18+',
        14: 'ПЕРМЬ 18+',
        9: 'РОСТОВ-НА-ДОНУ 18+',
        6: 'САМАРА 18+',
        2: 'САНКТ-ПЕТЕРБУРГ 18+',
        10: 'САРАТОВ 18+',
        39: 'СТАВРОПОЛЬ 18+',
        3: 'ТВЕРЬ 18+',
        55: 'ТОМСК 18+',
        16: 'ТЮМЕНЬ 18+',
        20: 'УФА 18+',
        26: 'ХАБАРОВСК 18+',
        13: 'ЧЕЛЯБИНСК 18+',
        7: 'ЯРОСЛАВЛЬ 18+'
    }

    targets_ekaterinburg = {
        'ЕКАТЕРИНБУРГ 14-44': 'age >= 14 AND age <= 44',
        'ЕКАТЕРИНБУРГ 10-45': 'age >= 10 AND age <= 45',
        'ЕКАТЕРИНБУРГ 25-59':' age >= 25 AND age <= 59',
        'ЕКАТЕРИНБУРГ М 18+': 'age >= 18 AND sex = 1',
        'ЕКАТЕРИНБУРГ Ж 25-59': 'age >= 25 AND age <= 59 AND sex = 2',
        'ЕКАТЕРИНБУРГ 25-54': 'age >= 25 AND age <= 54',
        'ЕКАТЕРИНБУРГ Ж 14-44': 'age >= 14 AND age <= 44 AND sex = 2'
    }

    targets_nizniy_novgorod = {
        'НИЖНИЙ НОВГОРОД 14-44': 'age >= 14 AND age <= 44',
        'НИЖНИЙ НОВГОРОД 10-45': 'age >= 10 AND age <= 45',
        'НИЖНИЙ НОВГОРОД 25-59':' age >= 25 AND age <= 59',
        'НИЖНИЙ НОВГОРОД М 18+': 'age >= 18 AND sex = 1',
        'НИЖНИЙ НОВГОРОД 25-54': 'age >= 25 AND age <= 54',
        'НИЖНИЙ НОВГОРОД Ж 14-44': 'age >= 14 AND age <= 44 AND sex = 2'
    }

    targets_novosibirsk = {
        'НОВОСИБИРСК 14-44': 'age >= 14 AND age <= 44',
        'НОВОСИБИРСК 10-45': 'age >= 10 AND age <= 45',
        'НОВОСИБИРСК 25-59':' age >= 25 AND age <= 59',
        'НОВОСИБИРСК М 18+': 'age >= 18 AND sex = 1',
        'НОВОСИБИРСК 25-54': 'age >= 25 AND age <= 54'
    }

    targets_saint_petersburg = {
        'САНКТ-ПЕТЕРБУРГ 18+': 'age >= 18',
        'САНКТ-ПЕТЕРБУРГ Ж 25-59': 'age >= 25 AND age <= 59 AND sex = 2',
        'САНКТ-ПЕТЕРБУРГ 10-45':' age >= 10 AND age <= 45',
        'САНКТ-ПЕТЕРБУРГ 25-49':' age >= 25 AND age <= 49',
        'САНКТ-ПЕТЕРБУРГ 14-59':' age >= 14 AND age <= 59',
        'САНКТ-ПЕТЕРБУРГ М 18+': 'age >= 18 AND sex = 1',
        'САНКТ-ПЕТЕРБУРГ 14-44':' age >= 14 AND age <= 44',
        'САНКТ-ПЕТЕРБУРГ 25-54': 'age >= 25 AND age <= 54',
        'САНКТ-ПЕТЕРБУРГ Ж 14-44': 'age >= 14 AND age <= 44 AND sex = 2'
    }
    regions_list = [regions_dict_4_45, regions_dict_6_54, regions_dict_14_54, regions_dict_18, None, None, None, None, None]
    targets_list = [targets_ekaterinburg, targets_nizniy_novgorod, targets_novosibirsk, targets_saint_petersburg]

class Constants__Columns:
    
    columns_new_4_45 = ['ЕКАТЕРИНБУРГ 4-45', 'КАЗАНЬ 4-45', 'КРАСНОДАР 4-45', 
                       'НИЖНИЙ НОВГОРОД 4-45', 'НОВОСИБИРСК 4-45', 'САНКТ-ПЕТЕРБУРГ 4-45', 
                       'ЧЕЛЯБИНСК 4-45', 'ВОЛГОГРАД 4-45', 'ВОРОНЕЖ 4-45', 'ИРКУТСК 4-45', 
                       'ПЕРМЬ 4-45', 'РОСТОВ-НА-ДОНУ 4-45', 'САРАТОВ 4-45', 'ТЮМЕНЬ 4-45',
                        'ВЛАДИВОСТОК 4-45', 'СТАВРОПОЛЬ 4-45', 'ХАБАРОВСК 4-45', 'САМАРА 4-45', 'КРАСНОЯРСК 4-45']

    columns_new_6_54 = ['БАРНАУЛ 6-54', 'ВЛАДИВОСТОК 6-54', 'ВОЛГОГРАД 6-54', 'ВОРОНЕЖ 6-54', 
                        'ИРКУТСК 6-54', 'КЕМЕРОВО 6-54', 'КРАСНОДАР 6-54', 'КРАСНОЯРСК 6-54', 
                        'НИЖНИЙ НОВГОРОД 6-54', 'НОВОСИБИРСК 6-54', 'ОМСК 6-54', 'ПЕРМЬ 6-54', 
                        'РОСТОВ-НА-ДОНУ 6-54', 'САМАРА 6-54', 'САРАТОВ 6-54', 'СТАВРОПОЛЬ 6-54', 
                        'ТВЕРЬ 6-54', 'ТОМСК 6-54', 'ТЮМЕНЬ 6-54', 'УФА 6-54', 'ХАБАРОВСК 6-54', 
                        'ЧЕЛЯБИНСК 6-54', 'ЯРОСЛАВЛЬ 6-54']

    columns_new_14_54 = ['БАРНАУЛ 14-54', 'ВЛАДИВОСТОК 14-54', 'ВОЛГОГРАД 14-54', 'ВОРОНЕЖ 14-54', 'ИРКУТСК 14-54', 
                         'КАЗАНЬ 14-54', 'КЕМЕРОВО 14-54', 'КРАСНОДАР 14-54', 'КРАСНОЯРСК 14-54', 'ОМСК 14-54', 'ПЕРМЬ 14-54', 
                         'РОСТОВ-НА-ДОНУ 14-54', 'САМАРА 14-54', 'САРАТОВ 14-54', 'СТАВРОПОЛЬ 14-54', 'ТВЕРЬ 14-54', 'ТОМСК 14-54',
                         'ТЮМЕНЬ 14-54', 'УФА 14-54', 'ХАБАРОВСК 14-54', 'ЧЕЛЯБИНСК 14-54', 'ЯРОСЛАВЛЬ 14-54']
    
    columns_new_18 = ['БАРНАУЛ 18+', 'ВЛАДИВОСТОК 18+', 'ВОЛГОГРАД 18+', 'ВОРОНЕЖ 18+', 'ЕКАТЕРИНБУРГ 18+', 'ИРКУТСК 18+', 
                       'КАЗАНЬ 18+', 'КЕМЕРОВО 18+', 'КРАСНОДАР 18+', 'КРАСНОЯРСК 18+', 'НИЖНИЙ НОВГОРОД 18+', 'НОВОСИБИРСК 18+', 
                       'ОМСК 18+', 'ПЕРМЬ 18+', 'РОСТОВ-НА-ДОНУ 18+', 'САМАРА 18+', 'САНКТ-ПЕТЕРБУРГ 18+', 'САРАТОВ 18+', 
                       'СТАВРОПОЛЬ 18+', 'ТВЕРЬ 18+', 'ТОМСК 18+', 'ТЮМЕНЬ 18+', 'УФА 18+', 'ХАБАРОВСК 18+', 
                       'ЧЕЛЯБИНСК 18+', 'ЯРОСЛАВЛЬ 18+']

    columns_new_ekb = ['ЕКАТЕРИНБУРГ 14-44', 'ЕКАТЕРИНБУРГ 10-45', 'ЕКАТЕРИНБУРГ 25-59', 'ЕКАТЕРИНБУРГ М 18+', 
                       'ЕКАТЕРИНБУРГ Ж 25-59', 'ЕКАТЕРИНБУРГ 25-54', 'ЕКАТЕРИНБУРГ Ж 14-44']
    columns_new_nn = ['НИЖНИЙ НОВГОРОД 14-44', 'НИЖНИЙ НОВГОРОД 10-45', 'НИЖНИЙ НОВГОРОД 25-59', 
                       'НИЖНИЙ НОВГОРОД М 18+', 'НИЖНИЙ НОВГОРОД 25-54', 'НИЖНИЙ НОВГОРОД Ж 14-44']
    
    columns_new_novosibirsk = ['НОВОСИБИРСК 14-44', 'НОВОСИБИРСК 10-45', 'НОВОСИБИРСК 25-59', 'НОВОСИБИРСК М 18+', 'НОВОСИБИРСК 25-54']

    columns_new_saint_petersburg = ['САНКТ-ПЕТЕРБУРГ 18+', 'САНКТ-ПЕТЕРБУРГ Ж 25-59', 'САНКТ-ПЕТЕРБУРГ 10-45', 'САНКТ-ПЕТЕРБУРГ 25-49', 
                                    'САНКТ-ПЕТЕРБУРГ 14-59', 'САНКТ-ПЕТЕРБУРГ М 18+', 'САНКТ-ПЕТЕРБУРГ 14-44', 'САНКТ-ПЕТЕРБУРГ 25-54', 'САНКТ-ПЕТЕРБУРГ Ж 14-44']

class Holidays:
    '''
    Holiday days for Prophet
    '''
    public_holiday_2013 = pd.DataFrame({
    'holiday': 'public_holiday_2013',
    'ds': pd.to_datetime([
                    '2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04', '2013-01-05', '2013-01-06', '2013-01-07',
                    '2013-01-08', '2013-03-08', '2013-05-01', '2013-05-02', '2013-05-03', '2013-05-09', '2013-05-10',
                    '2013-06-12', '2013-11-04', '2013-12-30', '2013-12-31'
  ]),
    'lower_window': 0,
    'upper_window': 0
})
    public_holiday_2014 = pd.DataFrame({
    'holiday': 'public_holiday_2014',
    'ds': pd.to_datetime([
                        '2014-01-01', '2014-01-02', '2014-01-03', '2014-01-04', '2014-01-05', '2014-01-06', '2014-01-07',
                        '2014-01-08', '2014-03-10', '2014-05-01', '2014-05-02', '2014-05-09', '2014-06-12', '2014-06-13',
                        '2014-11-03', '2014-11-04', '2014-12-30', '2014-12-31'
    ]),
    'lower_window': 0,
    'upper_window': 0
    })
    public_holiday_2015 = pd.DataFrame({
    'holiday': 'public_holiday_2015',
    'ds': pd.to_datetime([
                        '2015-01-01', '2015-01-02', '2015-01-03', '2015-01-04', '2015-01-05', '2015-01-06', '2015-01-07',
                        '2015-01-08', '2015-02-23', '2015-03-09', '2015-05-01', '2015-05-04', '2015-05-11', '2015-06-12',
                        '2015-11-04', '2015-12-30', '2015-12-31'
    ]),
    'lower_window': 0,
    'upper_window': 0
    })
    public_holiday_2016 = pd.DataFrame({
    'holiday': 'public_holiday_2016',
    'ds': pd.to_datetime([
                        '2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04', '2016-01-05', '2016-01-06', '2016-01-07',
                        '2016-01-08', '2016-02-22', '2016-02-23', '2016-03-07', '2016-03-08', '2016-05-02', '2016-05-03',
                        '2016-05-09', '2016-06-13', '2016-11-04', '2016-12-30', '2016-12-31'
    ]),
    'lower_window': 0,
    'upper_window': 0
    })
    public_holiday_2017 = pd.DataFrame({
    'holiday': 'public_holiday_2017',
    'ds': pd.to_datetime([
                        '2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04', '2017-01-05', '2017-01-06', '2017-01-07',
                        '2017-01-08', '2017-02-23', '2017-02-24', '2017-03-08', '2017-05-01', '2017-05-08', '2017-05-09',
                        '2017-06-12', '2017-11-06', '2017-12-30', '2017-12-31'
    ]),
    'lower_window': 0,
    'upper_window': 0
    })
    public_holiday_2018 = pd.DataFrame({
    'holiday': 'public_holiday_2018',
    'ds': pd.to_datetime([
                        '2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04', '2018-01-05', '2018-01-06', '2018-01-07',
                        '2018-01-08', '2018-02-23', '2018-03-08', '2018-03-09', '2018-04-29', '2018-04-30', '2018-05-01', 
                        '2018-05-02', '2018-05-09', '2018-06-10', '2018-06-11', '2018-06-12', '2018-11-06', '2018-12-30', 
                        '2018-12-31'
    ]),
    'lower_window': 0,
    'upper_window': 0
    })

    public_holiday_2019 = pd.DataFrame({
    'holiday': 'public_holiday_2019',
    'ds': pd.to_datetime([
                        '2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04', '2019-01-05', '2019-01-06', '2019-01-07',
                        '2019-01-08', '2019-02-23', '2019-03-08', '2019-05-01', '2019-05-02', '2019-05-03', '2019-05-09',
                        '2019-05-10', '2019-06-12', '2019-11-04', '2019-12-31'
    ]),
    'lower_window': 0,
    'upper_window': 0
    })

    public_holiday_2020 = pd.DataFrame({
    'holiday': 'public_holiday_2020',
    'ds': pd.to_datetime([
                        '2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04', '2020-01-05', '2020-01-06', '2020-01-07',
                        '2020-01-08', '2020-02-24', '2020-03-09', '2020-05-01', '2020-05-04', '2020-05-05', '2020-05-11',
                        '2020-06-12', '2020-11-04', '2020-12-31'
    ]),
    'lower_window': 0,
    'upper_window': 0
    })
    public_holiday_2021 = pd.DataFrame({
    'holiday': 'public_holiday_2021',
    'ds': pd.to_datetime([
                        '2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04', '2021-01-05', '2021-01-06', '2021-01-07',
                        '2021-01-08', '2021-02-22', '2021-02-23', '2021-03-08', '2021-05-03', '2021-05-04', '2021-05-06',
                        '2021-05-07', '2021-05-10', '2021-06-14', '2021-11-01', '2021-11-02', '2021-11-03', '2021-11-04',
                        '2021-11-05', '2021-12-31'
    ]),
    'lower_window': 0,
    'upper_window': 0
    })
    public_holiday_2022 = pd.DataFrame({
    'holiday': 'public_holiday_2022',
    'ds': pd.to_datetime([
                        '2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04', '2022-01-05', '2022-01-06', '2022-01-07',
                        '2022-01-08', '2022-02-23', '2022-03-07', '2022-03-08', '2022-05-02', '2022-05-03', '2022-05-09',
                        '2022-05-10', '2022-06-13', '2022-11-04', '2022-12-31'
    ]),
    'lower_window': 0,
    'upper_window': 0
    })
    public_holiday_2023 = pd.DataFrame({
    'holiday': 'public_holiday_2023',
    'ds': pd.to_datetime([
                        '2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05', '2023-01-06', '2023-01-07',
                        '2023-01-08', '2023-02-23', '2023-02-24', '2023-03-08', '2023-05-01', '2023-05-08', '2023-05-09',
                        '2023-06-12', '2023-11-06', '2023-12-31'
    ]),
    'lower_window': 0,
    'upper_window': 0
    })

    public_holiday_2024 = pd.DataFrame({
    'holiday': 'public_holiday_2024',
    'ds': pd.to_datetime([
                        '2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04', '2024-01-05', '2024-01-06', '2024-01-07',
                        '2024-01-08', '2024-02-23', '2024-03-08', '2024-04-29', '2024-04-30', '2024-05-01', '2024-05-09', '2024-05-10',
                        '2024-06-12', '2024-11-04', '2024-12-30', '2024-12-31'
    ]),
    'lower_window': 0,
    'upper_window': 0
    })
    
    public_holiday_2025 = pd.DataFrame({
    'holiday': 'public_holiday_2025',
    'ds': pd.to_datetime([
                        '2025-01-01', '2025-01-02', '2025-01-03', '2025-01-04', '2025-01-05', '2025-01-06', '2025-01-07',
                        '2025-01-08', '2025-02-23', '2025-03-08', '2025-04-29', '2025-05-01', '2025-05-02', '2025-05-08', '2025-05-09',
                        '2025-06-12', '2025-06-13', '2025-11-03', '2025-11-04', '2025-12-31'
    ]),
    'lower_window': 0,
    'upper_window': 0
    })

    Work_saturday = pd.DataFrame({
    'holiday': 'Work_saturday',
    'ds': pd.to_datetime([
                        '2016-02-20', '2018-04-28', '2018-06-09', '2018-12-28', '2021-02-20', '2021-02-20', '2022-03-05', '2024-04-27', '2024-11-02', '2024-12-28', '2025-11-01'
    ]),
    'lower_window': 0,
    'upper_window': 0
    })
    holidays = pd.concat((public_holiday_2014, public_holiday_2015, public_holiday_2016, public_holiday_2017, public_holiday_2018, public_holiday_2019, public_holiday_2020,
                        public_holiday_2021, public_holiday_2022, public_holiday_2023, public_holiday_2024, public_holiday_2025))

class Prophet_Constants:
    cond_holidays = {
        'All 4-45': [True] * len(Constants__Columns.columns_new_4_45), 
        'All 6-54': [False, True, True, True, True, True, True, True, False, True, False, True, False, True, True, True, True, True, True, True, False, True, True],
        'All 14-54': [True, True, True, True, True, True, True, True, True, False, True, False, True, True, True, True, True, True, True, False, True, True],
        'All 18+': [True, True, True, True, False, True, True, True, True, True, False, True, False, True, False, True, False, True, True, True, True, True, True, False, True, True],
        'EKB_NN_KZN': [True, True, True, False, True, True, True, True, True, True, True, True, True, True],
        'Novosibirsk': [False, False, True, True, True],
        'SaintPetersburg': [False, False, True, True, False, True, True, False, True]
    }

    cond_date_count = {
        'All 4-45': ['2021-12-31'] * len(Constants__Columns.columns_new_4_45),
        'All 6-54': ['2013-12-31', '2014-12-31', '2013-12-31', '2013-12-31', '2018-12-31', '2016-12-31', 
                        '2013-12-31', '2013-12-31', '2018-12-31', '2013-12-31',  '2013-12-31', '2017-12-31', 
                        '2013-12-31', '2015-12-31', '2013-12-31', '2016-12-31', '2017-12-31', '2018-12-31', 
                        '2013-12-31', '2013-12-31', '2018-12-31', '2018-12-31', '2016-12-31'],
        'All 14-54': ['2013-12-31', '2014-12-31', '2013-12-31', '2013-12-31', '2018-12-31', '2013-12-31', 
                        '2016-12-31', '2013-12-31', '2013-12-31',  '2013-12-31', '2017-12-31', '2013-12-31', 
                        '2015-12-31', '2013-12-31', '2016-12-31', '2017-12-31', '2018-12-31', '2013-12-31', 
                        '2013-12-31', '2018-12-31', '2018-12-31', '2016-12-31'],
        'All 18+': ['2018-12-31', '2014-12-31', '2013-12-31', '2013-12-31', '2015-12-31', '2018-12-31', 
                    '2013-12-31', '2016-12-31', '2013-12-31', '2013-12-31', '2018-12-31', '2015-12-31', 
                    '2013-12-31', '2017-12-31', '2013-12-31', '2015-12-31', '2017-12-31', '2013-12-31', 
                    '2016-12-31', '2017-12-31', '2018-12-31', '2013-12-31', '2013-12-31', '2018-12-31', 
                    '2018-12-31', '2016-12-31'],
        'EKB_NN_KZN': ['2015-12-31', '2016-12-31', '2017-12-31', '2016-12-31', '2017-12-31', '2017-12-31', 
                        '2013-12-31', '2017-12-31', '2016-12-31', '2018-12-31', '2018-12-31',  '2018-12-31',
                        '2018-12-31',  '2018-12-31'],
        'Novosibirsk': ['2018-12-31', '2013-12-31', '2018-12-31', '2013-12-31', '2018-12-31'],
        'SaintPetersburg': ['2017-12-31', '2013-12-31', '2018-12-31', '2016-12-31', '2016-12-31', '2016-12-31', '2016-12-31', '2018-12-31', '2016-12-31']
    }